Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
pd.Series([4, 8, 15, 16, 23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
s=[[1,2,3,4,5,6,7,8,9,10]]

In [6]:
pd.Series(s)

0    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:


Name     Age     Gender
Alice     25     Female
Bob       30      Male
Claire    27     Female
         






Then, print the DataFrame.

In [7]:
df=[['Name','Age','Gender'],['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]

In [10]:
pd.DataFrame(df)

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

ANS.As noted in the table, a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

ANS. Most Important Pandas Functions for Data Science
read_csv() This is one of the most crucial pandas methods in Python. ...
head() head(n) is used to return the first n rows of a dataset. ...
describe() ...
memory_usage() ...
astype() ...
loc[:] ...
to_datetime() ...
value_counts()

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

ANS.DataFrames are both value and size-mutable (A Series, by contrast, is only value-mutable, not size-mutable. The length of a Series cannot be changed although the values can be changed).

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [16]:
r1=['name','roll']
r2=['SK','26']
r3=['kk','21']
l1=pd.Series(r1)
l2=pd.Series(r2)
l3=pd.Series(r3)
pd.concat([l1,l2,l3])

0    name
1    roll
0      SK
1      26
0      kk
1      21
dtype: object